In [1]:
import pandas as pd

Документация по использованию всех функций и методов библиотеки: http://pandas.pydata.org/pandas-docs/stable/index.html

# Основные объекты Pandas

### Series

In [2]:
s = pd.Series(data = [1,2,3,4,5], index = 'one two three four five'.split())

In [4]:
# Обращаемся ко всей серии данных или к отдельному элементу 
s['two']

2

### DataFrame

In [5]:
df = pd.DataFrame({'name': 'Иванов Петров Сидоров'.split(), 
                   'age': [25, 41, 18]}, 
                  index = [12345, 24242, 56554])

In [6]:
df

          name  age
12345   Иванов   25
24242   Петров   41
56554  Сидоров   18

In [7]:
# Извлекаем весь столбец
df['age']

12345    25
24242    41
56554    18
Name: age, dtype: int64

In [8]:
df.age

12345    25
24242    41
56554    18
Name: age, dtype: int64

In [9]:
# Извлекаем отдельный элемент, способ 1 (используем значения индексов и названия столбцов)
df['age'][12345]

25

In [10]:
df.loc[12345]['age']

25

In [11]:
# Извлекаем отдельный элемент, способ 2 (используем номера строк и столбцов)
df.iloc[0][1]

25

In [12]:
# Объединяем два способа
df['age'].iloc[0]

25

# Загружаем датасет и смотрим, что в нем есть

Для работы будем использовать известный датасет, содержащий информацию о пассажирах Титаника. Скачать датасет и посмотреть его описание можно по адресу: https://www.kaggle.com/c/titanic/data (требуется регистрация).  
Скачать без регистрации: https://yadi.sk/i/H0tNVU14R3K1qA

In [13]:
df = pd.read_csv('train.csv')

In [24]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [21]:
df.describe()
#Будьте осторожны с этим методом при работе с большими датасетами!

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [22]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

Можно вывести на экран только определённые столбцы:

In [26]:
df[['Age', 'Survived', 'Pclass']].head()

    Age  Survived  Pclass
0  22.0         0       3
1  38.0         1       1
2  26.0         1       3
3  35.0         1       1
4  35.0         0       3

### Фильтрация данных

In [29]:
# Выведем данные только о пассажирах 1 класса (первые 10 строк):
df[(df['Pclass'] == 1)&(df['Survived'] == 0)].head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S
64,65,0,1,"Stewart, Mr. Albert A",male,NaN,0,0,PC 17605,27.7208,NaN,C
83,84,0,1,"Carrau, Mr. Francisco M",male,28.0,0,0,113059,47.1000,NaN,S
92,93,0,1,"Chaffee, Mr. Herbert Fuller",male,46.0,1,0,W.E.P. 5734,61.1750,E31,S

Считаем дополнительные статистические показатели для определённого столбца:

In [30]:
# Найдем минимальную стоимость билета:
df['Fare'].min()

0.0

In [31]:
# Найдем минимальную стоимость билета для взрослого пассажира:
df[df['Age'] >= 18]['Fare'].min()

0.0

In [33]:
df[(df.Fare ==0)&(df['Age'] >= 18)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
179,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S
263,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0,NaN,S

In [34]:
# Найдем возраст самого страшего пассажира, путешествовавшего по бесплатному билету
df[(df['Fare'] == 0)&(df['Age']>18)]['Age'].max()

49.0

In [35]:
# Найдем минимальную стоимость билета для детей:
df[df.Age<18]['Fare'].min()

7.0542

In [36]:
# Найдем минимальную стоимость платных билетов для взрослых:
df[(df['Fare'] != 0)&(df.Age >= 18)]['Fare'].min()

4.0125

In [37]:
# Найдем среднюю стоимость билета в первом классе
df[df.Pclass == 1]['Fare'].mean()

84.15468749999992

In [38]:
# Найдем среднюю стоимость билета в первом классе без учета бесплатных билетов
df[(df['Fare']>0)&(df['Pclass']==1)]['Fare'].mean()

86.14887440758287

# Эксперименты с группировками

## value_counts()

In [39]:
# Посчитаем статистику выживших и погибших
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [40]:
# Посчитаем статистику выживших и погибших среди мужчин
df[df['Sex'] == 'male']['Survived'].value_counts()

0    468
1    109
Name: Survived, dtype: int64

In [41]:
# Посчитаем статистику выживших и погибших среди женщин
df[df['Sex'] == 'female']['Survived'].value_counts()

1    233
0     81
Name: Survived, dtype: int64

In [42]:
# Организуем вывод обобщенных данных о погибших и выживших среди мужчин и женщин
for sex in df['Sex'].unique():
    if sex == 'male':
        print('Данные о мужчинах')
    else:
        print('Данные о женщинах')
    print(df[df['Sex']==sex]['Survived'].value_counts())
    print()

Данные о мужчинах
0    468
1    109
Name: Survived, dtype: int64

Данные о женщинах
1    233
0     81
Name: Survived, dtype: int64

In [44]:
# Посчитаем статистику выживших и погибших среди пассажиров 1 класса
df[df['Pclass'] == 1]['Survived'].value_counts()

1    136
0     80
Name: Survived, dtype: int64

In [46]:
# Посчитаем обобщенные данные по классам и полу
for Class in sorted(df['Pclass'].unique()):
    print(Class, 'класс')
    for sex in df['Sex'].unique():
        if sex == 'male':
            print('Данные о мужчинах')
        else:
            print('Данные о женщинах')
        print(df[(df.Sex == sex)&(df.Pclass == Class)].Survived.value_counts())

1 класс
Данные о мужчинах
0    77
1    45
Name: Survived, dtype: int64
Данные о женщинах
1    91
0     3
Name: Survived, dtype: int64
2 класс
Данные о мужчинах
0    91
1    17
Name: Survived, dtype: int64
Данные о женщинах
1    70
0     6
Name: Survived, dtype: int64
3 класс
Данные о мужчинах
0    300
1     47
Name: Survived, dtype: int64
Данные о женщинах
1    72
0    72
Name: Survived, dtype: int64

## groupby()

In [47]:
# Считаем средний возраст выживших и погибших
# (сгруппируем пассажиров по столбцу 'Survived' и посчитаем средний возраст в каждой группе)
df.groupby(by = 'Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [52]:
# Считаем средний возраст выживших и погибших по классам
# (сгруппируем пассажиров по столбцам 'Survived'и 'Pclass' и посчитаем средний возраст в каждой группе)
df.groupby(by = ['Survived','Pclass'])['Age'].mean()

Survived  Pclass
0         1         43.695312
          2         33.544444
          3         26.555556
1         1         35.368197
          2         25.901566
          3         20.646118
Name: Age, dtype: float64

In [54]:
# Считаем количество выживших и погибших в зависимости от класса и пола
df.groupby(by = ['Sex','Pclass','Survived'])['Name'].count()

Sex     Pclass  Survived
female  1       0             3
                1            91
        2       0             6
                1            70
        3       0            72
                1            72
male    1       0            77
                1            45
        2       0            91
                1            17
        3       0           300
                1            47
Name: Name, dtype: int64

In [56]:
df.groupby(by=['Pclass','Sex']).Survived.value_counts()

Pclass  Sex     Survived
1       female  1            91
                0             3
        male    0            77
                1            45
2       female  1            70
                0             6
        male    0            91
                1            17
3       female  0            72
                1            72
        male    0           300
                1            47
Name: Survived, dtype: int64

In [57]:
# Считаем минимальную, среднюю и максимальную стоимость билетов по классам (исключая бесплатные билеты)
df[df.Fare != 0].groupby(by = 'Pclass')['Fare'].agg(['min', 'mean', 'max'])

            min       mean       max
Pclass
1        5.0000  86.148874  512.3292
2       10.5000  21.358661   73.5000
3        4.0125  13.787875   69.5500

In [58]:
# Считаем минимальные и максимальные возраст и сумму оплаты по классам для выживших и погибших пассажиров
df[df.Fare != 0].groupby(['Pclass', 'Survived'])[['Age', 'Fare']].agg(['min', 'max'])

                   Age           Fare
                   min   max      min       max
Pclass Survived
1      0          2.00  71.0   5.0000  263.0000
       1          0.92  80.0  25.9292  512.3292
2      0         16.00  70.0  10.5000   73.5000
       1          0.67  62.0  10.5000   65.0000
3      0          1.00  74.0   4.0125   69.5500
       1          0.42  63.0   6.9750   56.4958

In [59]:
df[df.Fare != 0].groupby(['Pclass', 'Survived'])[['Age', 'Fare']].agg(['min', 'max'])['Fare']['max'][3][0]

69.55

In [ ]:
# Считаем минимальную, среднюю и максимальную стоимость билета для пассажиров в зависимости от пола и класса

## pivot_table()

In [60]:
# Считаем средний возраст выживших и погибших пассажиров по классам
df.pivot_table(values = 'Age', index = 'Pclass', columns = 'Survived', aggfunc = 'mean')

Survived          0          1
Pclass
1         43.695312  35.368197
2         33.544444  25.901566
3         26.555556  20.646118

In [61]:
# Считаем минимальную, максимальную и среднюю стоимость билета 
# для выживших и погибших пассажиров в зависимости от класса
df.pivot_table(values = 'Fare', index = 'Pclass', columns = 'Survived', aggfunc = ['min', 'mean', 'max'])

          min                mean                max
Survived    0        1          0          1       0         1
Pclass
1         0.0  25.9292  64.684008  95.608029  263.00  512.3292
2         0.0  10.5000  19.412328  22.055700   73.50   65.0000
3         0.0   0.0000  13.669364  13.694887   69.55   56.4958

Извлекаем из полученных данных информацию о конкретной категории пассажиров

In [62]:
# Помещаем сгруппированные данные в отдельный датафрейм:
test = df.pivot_table(values = 'Fare', index = 'Pclass', columns = 'Survived', aggfunc = ['min', 'mean', 'max'])

In [63]:
# Извлекаем среднюю стоимость билета для погибших мужчин - пассажиров 1 класса:
test['mean'][0][1]

64.68400750000002

In [66]:
# Считаем среднее количесто братьев, сестер и супругов ('SibSp'), 
# которые путешествовали с выжившими и погибшими пассажирами разных классов
df.pivot_table(values = 'SibSp', index = 'Pclass', columns = ['Survived', 'Sex'], aggfunc = 'mean')

Survived         0                   1
Sex         female      male    female      male
Pclass
1         0.666667  0.272727  0.549451  0.377778
2         0.500000  0.307692  0.485714  0.529412
3         1.291667  0.523333  0.500000  0.340426

### Слияние таблиц

In [67]:
df2 = pd.read_csv('sexes.csv')

In [68]:
df2

      Sex Russian_name
0    male      мужчина
1  female      женщина

In [69]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [72]:
df3 = df.merge(df2, on = 'Sex').tail(10)

In [73]:
df3.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Russian_name
881,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C,женщина
882,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,женщина
883,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C,женщина
884,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C,женщина
885,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,женщина